---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelCorruption
source: html/2f2b8cc9-7838-3813-0105-5df435d4cd6d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelCorruption Property

Can't create Curtain Panel. A Panel or a Mullion is probably too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCurtainPanelCorruption { get; }
```